[
 {"_id":"5b2cf6e4164b096a000555ef","id":0,"Name":"This Week on RTÉ","video":"https://s3-eu-west-1.amazonaws.com/rte-alexa-images/Week+9.mp4","Type":"","Content":""},
 {"_id":"5b2661ffda158c060004a953","id":1,"Name":"This week on RTÉ","Type":"highlights","Content":"in a surprise development, president Putin has thrown Argentina out of the World Cup and replaced them with Republic of Ireland! \nThe Irish president said this was wonderful news and announced a public holiday.  Tune into r.t.e. Two tonight at 7pm to see Ireland take on England. \n\nOle ole ole!","video":"https://s3-eu-west-1.amazonaws.com/rte-alexa-images/Week+9.mp4"},
 {"_id":"5b2661ffda158c060004a955","id":3,"Name":"On Fair City...Emmet is on the receiving end of vicious gossip","Type":"soaps","Content":"in tonight's episode from Carrigstown, Bela reluctantly shows Emmet a photoshopped picture that he found plastered up on a wall.  \n\n<emphasis level=\"strong\">Oooeee,</emphasis> that sounds interesting!  Watch on RTE One at 7.30pm","video":"https://s3-eu-west-1.amazonaws.com/rte-alexa-images/fair-city.mp4"},
 {"_id":"5b2a52cd0cde857800069988","id":0,"Name":"The Oslo three are celebrated in Dublin","Type":"web","Content":"RTE sent a crack team of 3 to the E.B.U hackaThon in Oslo. In a surprise upset, the team came away with BOTH prizes. The Oslo 3 were feted upon arrival at Dublin airport and their salaries were doubled. ","video":""},
 {"_id":"5b360cde1fdd45460000ff1f","id":0,"Name":"From Prime Time, Abortion Fact Check","Type":"news","video":"https://s3-eu-west-1.amazonaws.com/rte-alexa-images/PRIME+TIME+FB+-+ABORTION+REFERENDUM+FACT+CHECK.mp4","Content":""},
 {"_id":"5b360ff61fdd45460000ff3e","id":0,"Name":"From Prime Time Direct Provision centre","Type":"news","video":"https://s3-eu-west-1.amazonaws.com/rte-alexa-images/PRIME+TIME+FB+-+BALLAGHADERREEN+DIRECT+PROVISION+CENTRE.mp4","Content":""},
 {"_id":"5b2a383e0cde8578000691ee","id":0,"Name":"Drumm to be sentenced over 7.2 billion euro fraud","Type":"web","Content":"The sentencing hearing for former Anglo Irish Bank Chief Executive David Drumm is taking place at Dublin Circuit Criminal Court today. \n\nHe was found guilty earlier this month of authorising a €7.2bn conspiracy to defraud and of false accounting. \n\n","video":""},
 {"_id":"5b2a38ea0cde8578000691f6","id":0,"Name":"EU leaders to hold mini-summit on migration","Type":"Web","Content":"Several EU leaders will hold special talks on migration in Brussels on Sunday to try to find answers ahead of a major summit next week. \nAll 28 European Union leaders are due at their full summit next Thursday to discuss plans to overhaul the bloc's asylum system, which has been under severe pressure since the migration crisis exploded in 2015."},
 {"_id":"5b2a3c090cde857800069215","id":0,"Name":"Will Ferrell signs up for Eurovision film","Type":"web","Content":"Funnyman Will Ferrell will star in a new comedy film about the Eurovision Song Contest for Netflix.\n\nThe 50-year-old Anchorman actor will co-write and star in a new film titled Eurovision, which will poke fun at the popular annual singing competition. \n\n"},
 {"_id":"5b2661ffda158c060004a954","id":2,"Name":"Room to Improve","Type":"highlights","Content":"Dermot Bannon tries to help Katherine and Ann Louise, who share a former hunting lodge, they refer to as the shanty. \nThat’s on RTE 1 at 8pm"},
 {"_id":"5b2a571d0cde85780006c4bb","id":0,"Name":"Theresa May faces fresh Brexit showdown","Type":"web","Content":"British prime minister Theresa May faces a showdown with her pro EU MPs over parliament’s role in the final Brexit deal.  MPs will vote on the amendment to the EU bill which sets out how much power they will have if the government fails to agree a deal before Brexit in March 2019. "},
 {"_id":"5b2a5c620cde85780006e3b1","id":0,"Name":"Coronation Street - another shock marriage proposal","Type":"soaps","Content":"Fans already know about Steve and Tracey. But now we can reveal that Daniel and Shinade are also set to tie the knot. \nGet your hat out!\nCorrie is on RTE 2 at 7pm"},
 {"_id":"5b2a5d2d0cde85780006e6e0","id":0,"Name":"Home and away","Type":"soaps","Content":"Ryder is becoming increasingly paranoid about his and Coco's relationship when he sees a photo of her with a guy she met at camp online. \n\nWhen he confronts her, Coco is furious. \n\nTune in to Home and Away on RTE 2 at 4pm"},
 {"_id":"5b2a15810cde857800068e64","id":0,"Name":"Declan O'Rourke reveals why he won't perform for the Pope during Ireland visit","Type":"web","Content":"Declan O'Rourke said he refused an invitation to perform for the Pope when he visits Ireland in August because he wouldn't have been allowed to acknowledge victims of clerical abuse.\nFor more on this story, go to RTE dot I.e."},
 {"_id":"5b3610221fdd45460000ff42","id":0,"Name":"From Prime Time, Carers in Crisis","Type":"news","video":"https://s3-eu-west-1.amazonaws.com/rte-alexa-images/PRIME+TIME+FB+-+CARERS+IN+CRISIS+-+JACINTA.mp4","Content":""},
 {"_id":"5b2a463e0cde85780006927a","id":0,"Name":"Portugal score against Morocco","Type":"highlights","Content":"This is the alternative text that a user hears if he has an audio only echo device.   Echo devices with a screen will display the video clip. Trust us.   Morocco won the match 2-1","video":"https://s3-eu-west-1.amazonaws.com/rte-alexa-images/Portugal+vs+Morocco+1-0+Cristiano+Ronaldo+Goal+WORLD+CUP+20-06-2018+(youtubemp4.to).mp4"},
 {"_id":"5b36105e1fdd45460000ff49","id":0,"Name":"Prime Time, carers in Crisis - Jack","Type":"news","video":"https://s3-eu-west-1.amazonaws.com/rte-alexa-images/PRIME+TIME+FB+-+CARERS+IN+CRISTS+-+JACK.mp4","Content":""}
]